uhnp/src/Reports/ИсполнениеСтадийМеропритияДиаграммаГанта/ИсполнениеСтадийМеропритияДиаграммаГанта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИсполнениеСтадийМеропритияДиаграммаГанта</name>
  <attributes>
    <name>РисковоеСобытие</name>
    <type>
      <types>DocumentRef.РисковоеСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>DocumentRef.Мероприятие</types>
    </type>
  </attributes>
</mdclass:Report>

uhnp/src/InformationRegisters/ПрогрессСтадийМероприятий/ПрогрессСтадийМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрогрессСтадийМероприятий</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прогресс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Мероприятие</name>
    <type>
      <types>DocumentRef.Мероприятие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Стадия</name>
    <type>
      <types>CatalogRef.СтадииМероприятий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Reports/ИсполнениеСтадийМеропритияДиаграммаГанта/Forms/ФормаОтчета/Module.bsl
// Возвращает таблицу данных для диаграммы Ганта по рисковому 
// событию РисковоеСобытиеВход либо мероприятию МероприятиеВход.
&НаСервере
Функция ПолучитьТаблицуДанныхГант(РисковоеСобытиеВход = Неопределено, МероприятиеВход = Неопределено)
	РезультатФункции = Новый ТаблицаЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрогрессСтадийМероприятий.Мероприятие КАК Мероприятие,
		|	ПрогрессСтадийМероприятий.Стадия КАК Стадия,
		|	ПрогрессСтадийМероприятий.ДатаНачала КАК ДатаНачала,
		|	ПрогрессСтадийМероприятий.ДатаОкончания КАК ДатаОкончания,
		|	ПрогрессСтадийМероприятий.Завершено КАК Завершено,
		|	ПрогрессСтадийМероприятий.Прогресс КАК Прогресс,
		|	ПрогрессСтадийМероприятий.Мероприятие.Контекст КАК РисковоеСобытие
		|ИЗ
		|	РегистрСведений.ПрогрессСтадийМероприятий КАК ПрогрессСтадийМероприятий
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &РисковоеСобытие = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПрогрессСтадийМероприятий.Мероприятие.Контекст = &РисковоеСобытие
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Мероприятие = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПрогрессСтадийМероприятий.Мероприятие = &Мероприятие
		|		КОНЕЦ";
	Если ЗначениеЗаполнено(МероприятиеВход) Тогда
		Запрос.УстановитьПараметр("Мероприятие", МероприятиеВход);
	Иначе
		Запрос.УстановитьПараметр("Мероприятие", Неопределено);
	КонецЕсли;
	Если ЗначениеЗаполнено(РисковоеСобытиеВход) Тогда
		Запрос.УстановитьПараметр("РисковоеСобытие", РисковоеСобытиеВход);
	Иначе
		Запрос.УстановитьПараметр("РисковоеСобытие", Неопределено);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	РезультатФункции = РезультатЗапроса.Выгрузить();
	Возврат РезультатФункции;
КонецФункции		// ПолучитьТаблицуДанныхГант()

// Серверная обёртка команды СформироватьОтчет.
&НаСервере
Процедура СформироватьОтчет_Сервер()
	// Получение данных диаграммы.
	ТаблицаДанных = ПолучитьТаблицуДанныхГант(Отчет.РисковоеСобытие, Отчет.Мероприятие);
	// Заполнение диаграммы.
	ГантРезультат.Очистить();
	Для Каждого ТекТаблицаДанных Из ТаблицаДанных Цикл
		ТочкаДиаграммы	 = ГантРезультат.УстановитьТочку(ТекТаблицаДанных.Стадия); 
		СерияДиаграммы	 = ГантРезультат.УстановитьСерию(ТекТаблицаДанных.Мероприятие); 
		ЗначениеТочки	 = ГантРезультат.ПолучитьЗначение(ТочкаДиаграммы, СерияДиаграммы); 
		Если (ТекТаблицаДанных.Прогресс < 100) И (НЕ ТекТаблицаДанных.Завершено) Тогда
			ДлинаПромежутка = (ТекТаблицаДанных.ДатаОкончания - ТекТаблицаДанных.ДатаНачала);
			ИнтервалВыполнения = ДлинаПромежутка*ТекТаблицаДанных.Прогресс/100;
			ДатаВыполнения = ТекТаблицаДанных.ДатаНачала + ИнтервалВыполнения;
			// Интервал от начала до даты выполнения.
			ТекИнтервал = ЗначениеТочки.Добавить(); 
			ТекИнтервал.Начало		 = ТекТаблицаДанных.ДатаНачала; 
			ТекИнтервал.Конец		 = ДатаВыполнения;
			ТекИнтервал.Цвет	 = WebЦвета.ЗеленыйЛес;
			ТекИнтервал.Расшифровка	 = ТекТаблицаДанных.Мероприятие;
			// Интервал от даты выполнения до конца.
			ТекИнтервал = ЗначениеТочки.Добавить(); 
			ТекИнтервал.Начало	 = ДатаВыполнения; 
			ТекИнтервал.Конец	 = ТекТаблицаДанных.ДатаОкончания;
			ТекИнтервал.Цвет	 = WebЦвета.БледноЗолотистый;
			ТекИнтервал.Расшифровка	 = ТекТаблицаДанных.Мероприятие;
		Иначе
			ТекИнтервал = ЗначениеТочки.Добавить(); 
			ТекИнтервал.Начало	 = ТекТаблицаДанных.ДатаНачала; 
			ТекИнтервал.Конец	 = ТекТаблицаДанных.ДатаОкончания; 
			ТекИнтервал.Цвет	 = WebЦвета.ЗеленыйЛес;
			ТекИнтервал.Расшифровка	 = ТекТаблицаДанных.Мероприятие;
		КонецЕсли;
	КонецЦикла; 
	ГантРезультат.Обновление = Истина; 
КонецПроцедуры		// СформироватьОтчет_Сервер()

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Если ЗначениеЗаполнено(Отчет.РисковоеСобытие) ИЛИ ЗначениеЗаполнено(Отчет.Мероприятие) Тогда
		СформироватьОтчет_Сервер();
	Иначе
		ТекстСообщения = НСтр("ru = 'Для формирования отчета требуется выбрать Инцидент, либо Мероприятие. Формирование отменено.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Мероприятие		 = Параметры.Мероприятие;
	Отчет.РисковоеСобытие	 = Параметры.РисковоеСобытие;
КонецПроцедуры
